# PrakMSU
Hometasks and class work (Language : C, C++)

ДЗ-1:  1-8 
ДЗ-2:  2.3, 2.4
ДЗ-3:  2.16, 2.17
ДЗ-4:  3.2 
ДЗ-5:  3.4, 3.5, 3.6


Задача 1-8
Написать функцию чтения строки со стандартного ввода. Длина строки неизвестна, считаем, что любой приготовленный буфер может оказаться мал. Системные ограничения не рассматриваем. Функция возвращает указатель на введенную строку или NULL в случае ошибки.


Задача 2-3
Удалить из файла все строки, длина которых больше (меньше, равна) заданного числа n. Имя файла и число n передаются в командной строке. Длина строк в файле не ограничена.


Задача 2-4
а) Написать функцию, которая читает со стандартного ввода по слову и создает список слов. Конец чтения фиксируется, когда достигнут перевод строки или конец файла.
Возвращает указатель на начало списка.
б) Сделать то же, но для чтения из заданного файла, имя файла передается в командной
строке. Файл содержит последовательность слов, читать слова только из строки файла с заданным номером. Если строки с таким номером нет, вернуть NULL.
Написать программу, в которой вызывается эта функция (эти функции) и полученный список слов выводится на печать в обратном порядке.
Указания к задаче
Слово — последовательность символов, ограниченная пробелами, символом перевода строки, началом или концом файла. 
Обратите внимание, что в обратном порядке выводятся именно слова, а не символы строки. Обеспечьте корректную работу при работе с пустым файлом, с пустой строкой.
По окончании работы освободите всю динамически выделенную память.

Задача 2-16
Реализовать команду UNIX cp [-ip] исходный_файл целевой_файл // копирование файла Копируется содержимое исходного файла (или указуемого исходным, если последний представляет собой символьную ссылку) в целевой.
Копирование в себя является ошибкой (должно отслеживаться).
Замечание: Копирование осуществлять блоками, а не по 1 байту.
Опции:
-i – запрос подтверждения перед попыткой копирования в существующий файл,
-p – вызывает копирование не только содержимого, но и атрибутов исходного файла (режима, идентификаторов владельца и владеющей группы, времени последнего доступа и изменения). Достаточно реализовать копирование режима доступа.
Порядок опций при задании команды может быть любым, и любая из них (в том числе и обе) может отсутствовать.
Указания к задаче
Однозначно идентифицируют файл пара – номер устройства и номер индексного дескриптора.
Для изменения режима доступа использовать одну из функций:
int chmod (const char* path, mode_t mode);
int fchmod (int filedes, mode_t mode);
Необходимо подключить заголовочные файлы <sys/types.h> и <sys/stat.h>.


Задача 2-17
Написать программу, работающую подобно команде more, которая осуществляет вывод файла на экран порциями по нажатию клавиши.
more [-n <целое_число>] [-s] <список файлов>
Опции:
-n <целое число> - целое число задает количество выводимых за один раз строк. Длина одной порции по умолчанию, т.е. в том случае, если эта опция не задана, 10 строк.
-s – предписывает заменять последовательность пустых строк одной пустой строкой.
Порядок опций при задании команды может быть любым, и любая из них (в том числе и обе) может отсутствовать.
Для каждого файла из списка отсчет строк начинать заново.


Задача 3-2
В командной строке передаются имена 2-ух исполняемых файлов, для каждого по 2 параметра, т.е. командная строка выглядит так:
>./a.out prog1 arg11 arg12 prog2 arg21 arg22
а) Запустить эти программы для параллельного исполнения.
б) Запустить эти программы для последовательного исполнения.
Определить, завершились ли они успешно (с точки зрения программы, с точки зрения системы).
По окончании работы не должно остаться процессов «зомби».
Указания к задаче
Напишите тестовые программы prog1 и prog2 (достаточно одной). Они должны работать не слишком быстро и осуществлять вывод на экран. Примерно так:
int main (int argc, char *argv[])
{
int i=0;
printf("my arguments are: %s %s\n",argv[1],argv[2]); while(i<15){
printf("my pid = %d\n",getpid()); i++;
} return 0;
}
Чтобы определить успешность завершения порожденного процесса, нужно исследовать значение, возвращенное через аргумент status функцией wait (или waitpid). В случае успешного завершения оба младших байта в status будут равны 0.


Задача 3-4
Протестировать работу с каналами. Определить, что происходит, если данных в канале находится меньше, чем запрашивается функцией read: блокируется ли read или возвращается, считав имеющееся?


Задача 3-5
Двустороннее взаимодействие с использованием каналов.
В командной строке передается имя файла. Процесс-отец создает «сына», открывает файл и передает «сыну» по строке. «Сын» читает строку, реверсирует ее, оставляя на месте ‘\n’, если он есть, и возвращает измененную строку «отцу». Тот читает ее и выводит в файл. В результате должен быть изменен исходный файл.
Указания к задаче
Необходимо использовать 2 канала. Почему?


Задача 3-6
Реализовать игру в «ping-pong» 3 процессов через каналы. Главный процесс порождает двух потомков по любой схеме (2 сына или сын-внук) и начинает передачу данных. Начальное и конечное целые числа переданы в командной строке. Принимающий увеличивает число на 1 и передает дальше, и так по кругу до тех пор, пока число не превысит заданный максимум. Каждый процесс выводит на экран текущее число и свой pid.
